configuration/Catalogs/_Карточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>_Карточки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарточки_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыКарточки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКарточки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ВидыКарточек</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/Catalogs/_Карточки/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Владелец_Форма = Неопределено;
	Владелец_Список = Неопределено;
	Владелец_Поле = Неопределено;
	_НаКлиенте.ОпределитьВладельцаФормы(ЭтаФорма.ВладелецФормы,Владелец_Форма,Владелец_Список,Владелец_Поле);
	
	Если 
	   ( Владелец_Форма <> Неопределено И Владелец_Форма.ИмяФормы = "Справочник._Карточки.Форма.ФормаЭлемента"
	   И Владелец_Список <> Неопределено И Владелец_Список.Имя = "Реквизиты" 
	   )
	Тогда
		ФункциональнаяРоль =  Владелец_Форма.Элементы[Владелец_Список.Имя].ТекущиеДанные.ВидРеквизита;
		ЭтаФорма.Отбор_ВидКарточки = _ВызовСервера.ПолучитьЗначение(ФункциональнаяРоль,"ВидКарточки");
		
		// Здесь нужно установить отбор в Динамическом списке "Список". по полю ВидыКарточки.Вид карточки, значение отбора хранится в ЭтаФорма.Отбор_ВидКарточки.
        // РЕАЛИЗАЦИЯ ОТБОРА:
        УстановитьОтборСписка();
    КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьОтборСписка()
//    Настройки = Список.КомпоновщикНастроек.Настройки;
//    ЭлементыОтбора = Настройки.Отбор.Элементы;
//    
//    // Ищем элемент отбора по полю ВидыКарточки.ВидКарточки
//    НайденныйЭлемент = Неопределено;
//    Для Каждого Элемент Из ЭлементыОтбора Цикл
//        Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") 
//           И Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидыКарточки.ВидКарточки") Тогда
//            НайденныйЭлемент = Элемент;
//            Прервать;
//        КонецЕсли;
//    КонецЦикла;
//    
//    Если НайденныйЭлемент <> Неопределено Тогда
//        НайденныйЭлемент.ПравоеЗначение = ЭтаФорма.Отбор_ВидКарточки;
//        НайденныйЭлемент.Использование = Истина;
//    КонецЕсли;
//КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСписка()
	
	ЭлементыОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	НайденныйЭлемент = Неопределено;
	Для Каждого Элемент Из ЭлементыОтбора Цикл
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных")
			И Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидыКарточки.ВидКарточки") Тогда
			НайденныйЭлемент = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НайденныйЭлемент = Неопределено Тогда
		НайденныйЭлемент = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НайденныйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидыКарточки.ВидКарточки");
		НайденныйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	НайденныйЭлемент.ПравоеЗначение = ЭтаФорма.Отбор_ВидКарточки;
	НайденныйЭлемент.Использование = Истина;
	
КонецПроцедуры
